narudoltatiyavattanachai/stm32f103_w5500/Middlewares/In_House/drivers/eth/w5500_socket.c
    /**
 * @file     w5500_socket.c
 * @brief    Socket API wrapper implementation for W5500 Ethernet controller
 * @author   Narudol T.
 * @date     2025-06-10
 * 
 * @details  This file implements wrapper functions around the third-party socket API
 *           (WIZnet ioLibrary_Driver) to isolate application code from direct
 *           dependencies on third-party libraries. All socket operations should use
 *           these wrappers instead of calling socket.h functions directly.
 *
 * @note     Usage:
 *           - Provides a stable, testable, and maintainable socket abstraction.
 *           - All configuration is centralized via eth_config.h macros.
 *           - Debugging can be enabled with W5500_DEBUG.
 *
 *           Maintenance:
 *           - Keep all buffer sizes, timeouts, and socket numbers in eth_config.h.
 *           - Use section headers and Doxygen-style comments for clarity.
 */

#include "w5500_socket.h"
#include "../../../Middlewares/Third_Party/ioLibrary_Driver_v3.2.0/Ethernet/socket.h"
#include "../../../Middlewares/Third_Party/ioLibrary_Driver_v3.2.0/Ethernet/wizchip_conf.h"
#include "eth_config.h"
#include <string.h>
#include <stdio.h>
#include "stm32f1xx_hal.h"

/*============================================================================*/
/*                         DEBUG PRINT MACRO                                  */
/*============================================================================*/
#ifdef W5500_DEBUG
#define DEBUG_PRINT(...)  printf(__VA_ARGS__)
#else
#define DEBUG_PRINT(...)
#endif

/*============================================================================*/
/*                         SOCKET MANAGEMENT                                  */
/*============================================================================*/

/*============================================================================*/
/**
* @brief Creates and opens a new socket
*
* @param sock_num  Socket number (0-7 for W5500)
* @param type      Socket type (TCP/UDP)
* @param port      Local port number
* @return int8_t   Socket number on success, negative error code on failure
*/
/*============================================================================*/
int8_t w5500_socket_open(uint8_t sock_num, w5500_sock_type_t type, uint16_t port)
{
    uint8_t protocol;
    uint8_t flag = 0; /* Default flag for normal operation */
    
    /* Convert socket type to protocol mode */
    switch (type) {
        case W5500_SOCK_TCP:
            protocol = Sn_MR_TCP;
            break;
        case W5500_SOCK_UDP:
            protocol = Sn_MR_UDP;
            break;
        default:
            DEBUG_PRINT("w5500_socket_open: Invalid socket type\r\n");
            return W5500_SOCK_ERROR;
    }
    
    /* Close the socket first if it was already open */
    w5500_socket_close(sock_num);
    
    /* Create the socket using third-party library */
    int8_t ret = socket(sock_num, protocol, port, flag);
    
    if (ret == sock_num) {
        DEBUG_PRINT("w5500_socket_open: Created socket %d (type %s) on port %d\r\n", 
                   sock_num, (type == W5500_SOCK_TCP) ? "TCP" : "UDP", port);
    } else {
        DEBUG_PRINT("w5500_socket_open: Failed to create socket %d, error %d\r\n", sock_num, ret);
    }
    
    return ret;
}

/*============================================================================*/
/**
* @brief Close a socket
* 
* @param sock_num  Socket number to close
* @return int8_t   0 on success, negative error code on failure
*/
/*============================================================================*/
int8_t w5500_socket_close(uint8_t sock_num)
{
    int8_t ret = close(sock_num);
    DEBUG_PRINT("w5500_socket_close: Closing socket %d, result %d\r\n", sock_num, ret);
    return ret;
}

/*============================================================================*/
/**
* @brief Set socket option
* 
* @param sock_num     Socket number
* @param option_type  Option type code
* @param option_value Pointer to option value
* @return int8_t      0 on success, negative error code on failure
*/
/*============================================================================*/
int8_t w5500_socket_setsockopt(uint8_t sock_num, uint8_t option_type, void *option_value)
{
    DEBUG_PRINT("w5500_socket_setsockopt: Setting option %d on socket %d\r\n", option_type, sock_num);
    return setsockopt(sock_num, option_type, option_value);
}

/*============================================================================*/
/**
* @brief Get socket option
* 
* @param sock_num     Socket number
* @param option_type  Option type code
* @param option_value Pointer to store option value
* @return int8_t      0 on success, negative error code on failure
*/
/*============================================================================*/
int8_t w5500_socket_getsockopt(uint8_t sock_num, uint8_t option_type, void *option_value)
{
    int8_t ret = getsockopt(sock_num, option_type, option_value);
    DEBUG_PRINT("w5500_socket_getsockopt: Getting option %d from socket %d, result %d\r\n", 
                option_type, sock_num, ret);
    return ret;
}

/*============================================================================*/
/*                         TCP SOCKET OPERATIONS                              */
/*============================================================================*/

/*============================================================================*/
/**
* @brief Connect a TCP socket to a remote host
* 
* @param sock_num    Socket number
* @param dest_ip     Destination IP address (4 bytes)
* @param dest_port   Destination port number
* @return int8_t     0 on success, negative error code on failure
*/
/*============================================================================*/
int8_t w5500_socket_connect(uint8_t sock_num, const uint8_t* dest_ip, uint16_t dest_port)
{
    int8_t ret = connect(sock_num, (uint8_t*)dest_ip, dest_port);
    
    if (ret == SOCK_OK) {
        DEBUG_PRINT("w5500_socket_connect: Socket %d connecting to %d.%d.%d.%d:%d\r\n", 
                   sock_num, dest_ip[0], dest_ip[1], dest_ip[2], dest_ip[3], dest_port);
    } else {
        DEBUG_PRINT("w5500_socket_connect: Socket %d connection failed, error %d\r\n", sock_num, ret);
    }
    
    return ret;
}

