narudoltatiyavattanachai/stm32f103_w5500/Middlewares/In_House/drivers/eth/w5500_socket.c
/*============================================================================*/
/**
* @brief Listen for incoming connections on a TCP socket
* 
* @param sock_num    Socket number
* @return int8_t     0 on success, negative error code on failure
*/
/*============================================================================*/
int8_t w5500_socket_listen(uint8_t sock_num)
{
    int8_t ret = listen(sock_num);
    
    if (ret == SOCK_OK) {
        DEBUG_PRINT("w5500_socket_listen: Socket %d listening\r\n", sock_num);
    } else {
        DEBUG_PRINT("w5500_socket_listen: Socket %d listen failed, error %d\r\n", sock_num, ret);
    * @param socket_num Socket number
    * @param protocol Must be Sn_MR_UDP (UDP only)
    * @param port Port number
    * @param flag Socket flag (0 for normal operation)
    * @return Socket number on success, negative value on error
    * @note Only UDP sockets are supported due to resource constraints.
    */
    int8_t w5500_socket(uint8_t socket_num, uint8_t protocol, uint16_t port, uint8_t flag) { ... }

    /**
    * @brief Close a socket
    * @param socket_num Socket number
    * @return 0 on success, negative value on error
    */
    int8_t w5500_close(uint8_t socket_num) { ... }

    /**
    * @brief Send data through a UDP socket to a specific destination
    * @param socket_num Socket number
    * @param data Pointer to data buffer
    * @param data_len Length of data to send
    * @param remote_ip Pointer to remote IP address (4 bytes)
    * @param remote_port Remote port number
    * @return Number of bytes sent on success, negative value on error
    */
    int32_t w5500_sendto(uint8_t socket_num, const uint8_t *data, uint16_t data_len, const uint8_t *remote_ip, uint16_t remote_port) { ... }

    /**
    * @brief Receive data from a UDP socket
    * @param socket_num Socket number
    * @param data Pointer to buffer to store received data
    * @param data_len Length of buffer
    * @param remote_ip Pointer to buffer to store remote IP address (4 bytes)
    * @param remote_port Pointer to store remote port number
    * @return Number of bytes received on success, negative value on error
    */
    int32_t w5500_recvfrom(uint8_t socket_num, uint8_t *data, uint16_t data_len, uint8_t *remote_ip, uint16_t *remote_port) { ... }

    /**
    * @brief Set socket option
    * @param socket_num Socket number
    * @param option_type Option type
    * @param option_value Pointer to option value
    * @return 0 on success, negative value on error
    */
    int8_t w5500_setsockopt(uint8_t socket_num, uint8_t option_type, void *option_value) { ... }

    /**
    * @brief Get socket option
    * @param socket_num Socket number
    * @param option_type Option type
    * @param option_value Pointer to option value
    * @return 0 on success, negative value on error
    */
    int8_t w5500_getsockopt(uint8_t socket_num, uint8_t option_type, void *option_value) { ... }

    /**
    * @brief Get socket status
    * @param socket_num Socket number
    * @return Socket status register value
    */
    uint8_t w5500_socket_status(uint8_t socket_num) { ... }


    /*============================================================================*/
    /**
    * @brief Initialize network interface using parameters from eth_config.h
    * @return true if initialization and configuration succeeded, false otherwise
    */
    /*============================================================================*/
    bool w5500_network_init(void)
    {
        wiz_NetInfo wiznet_info = {0};
        
        /* Set MAC address from configuration */
        uint8_t mac_addr[] = ETH_CONFIG_MAC;
        memcpy(wiznet_info.mac, mac_addr, sizeof(wiznet_info.mac));
        
        if (ETH_CONFIG_USE_DHCP) {
            /* If DHCP is enabled, set zero IPs initially */
            uint8_t zero_ip[4] = {0, 0, 0, 0};
            memcpy(wiznet_info.ip, zero_ip, sizeof(wiznet_info.ip));
            memcpy(wiznet_info.sn, zero_ip, sizeof(wiznet_info.sn));
            memcpy(wiznet_info.gw, zero_ip, sizeof(wiznet_info.gw));
            memcpy(wiznet_info.dns, zero_ip, sizeof(wiznet_info.dns));
            wiznet_info.dhcp = NETINFO_DHCP;
        } else {
            /* Use static IP configuration from eth_config.h */
            uint8_t ip[] = ETH_CONFIG_IP;
            uint8_t subnet[] = ETH_CONFIG_SUBNET;
            uint8_t gateway[] = ETH_CONFIG_GATEWAY;
            uint8_t dns[] = ETH_CONFIG_DNS;
            
            memcpy(wiznet_info.ip, ip, sizeof(wiznet_info.ip));
            memcpy(wiznet_info.sn, subnet, sizeof(wiznet_info.sn));
            memcpy(wiznet_info.gw, gateway, sizeof(wiznet_info.gw));
            memcpy(wiznet_info.dns, dns, sizeof(wiznet_info.dns));
            wiznet_info.dhcp = NETINFO_STATIC;
        }
        
        /* Apply network configuration to W5500 */
        wizchip_setnetinfo(&wiznet_info);
        wiz_NetInfo verify_info;
        wizchip_getnetinfo(&verify_info);
        if (memcmp(&wiznet_info, &verify_info, sizeof(wiz_NetInfo)) != 0) {
            DEBUG_PRINT("w5500_network_init: Failed to set network info!\r\n");
            return false;
        }
        /* If not using DHCP, IP is considered assigned */
        ip_assigned_flag = !ETH_CONFIG_USE_DHCP;
        DEBUG_PRINT("w5500_network_init: Network initialized, DHCP %s\r\n", 
                    ETH_CONFIG_USE_DHCP ? "enabled" : "disabled");
        return true;
    }




    /*============================================================================*/
    /**
    * @brief Initialize DHCP client process using parameters from eth_config.h
    * @return true if initialization succeeded, false otherwise
    */
    /*============================================================================*/
    bool w5500_dhcp_init(void)
    {
        if (!ETH_CONFIG_USE_DHCP) {
            DEBUG_PRINT("w5500_dhcp_init: DHCP not enabled in configuration\r\n");
            return false;
        }
        
        /* Initialize DHCP client with socket and buffer */
        DHCP_init(dhcp_socket, dhcp_buffer);
        
        /* Reset IP assignment flag */
        ip_assigned_flag = false;
        
