narudoltatiyavattanachai/stm32f103_w5500/Middlewares/In_House/drivers/eth/w5500_socket.c
        DEBUG_PRINT("w5500_dhcp_init: DHCP initialized on socket %d\r\n", dhcp_socket);
        
        return true;
    }



    /*============================================================================*/
    /**
    * @brief Register callbacks for IP assignment events
    * @param ip_assigned Callback for IP assigned event
    * @param ip_changed Callback for IP changed event
    * @param ip_conflict Callback for IP conflict event
    */
    /*============================================================================*/
    void w5500_register_ip_callbacks(void(*ip_assigned)(void), 
                                    void(*ip_changed)(void), 
                                    void(*ip_conflict)(void))
    {
        /* Register callback functions with DHCP library */
        reg_dhcp_cbfunc(ip_assigned, ip_changed, ip_conflict);
        
        DEBUG_PRINT("w5500_register_ip_callbacks: Callbacks registered\r\n");
    }



    /*============================================================================*/
    /**
    * @brief Process DHCP client tasks, should be called periodically
    * @return Current IP assignment status (W5500_IP_ASSIGNED, W5500_IP_CHANGED, W5500_IP_CONFLICT, or W5500_IP_NONE)
    */
    /*============================================================================*/
    ip_status_t w5500_dhcp_process(void)
    {
        if (!ETH_CONFIG_USE_DHCP) {
            return ip_assigned_flag ? W5500_IP_ASSIGNED : W5500_IP_NONE;
        }
        
        /* Run DHCP client process */
        uint8_t dhcp_status = DHCP_run();
        ip_status_t result = W5500_IP_NONE;
        static bool discovery_started = false;
        
        /* Map DHCP library status to our status enum */
        switch (dhcp_status) {
            case DHCP_IP_ASSIGN:
                ip_assigned_flag = true;
                result = W5500_IP_ASSIGNED;
                
                DEBUG_PRINT("w5500_dhcp_process: IP assigned\r\n");
                
                /* Auto-initialize discovery service when IP is assigned */
                if (!discovery_started) {
                    if (w5500_discovery_init()) {
                        discovery_started = true;
                        DEBUG_PRINT("w5500_dhcp_process: Discovery service auto-initialized\r\n");
                    }
                }
                break;
                
            case DHCP_IP_CHANGED:
                ip_assigned_flag = true;
                result = W5500_IP_CHANGED;
                
                DEBUG_PRINT("w5500_dhcp_process: IP changed\r\n");
                
                /* Restart discovery service when IP changes */
                if (w5500_discovery_init()) {
                    discovery_started = true;
                    DEBUG_PRINT("w5500_dhcp_process: Discovery service restarted with new IP\r\n");
                }
                break;
                
            case DHCP_IP_CONFLICT:
                ip_assigned_flag = false;
                result = W5500_IP_CONFLICT;
                discovery_started = false;
                DEBUG_PRINT("w5500_dhcp_process: IP conflict detected\r\n");
                break;
                
            default:
                /* No change in status */
                break;
        }
        
        return result;
    }




    /*============================================================================*/
    /**
    * @brief Check if an IP address is assigned
    * @return true if IP is assigned, false otherwise
    */
    /*============================================================================*/
    bool w5500_is_ip_assigned(void)
    {
        return ip_assigned_flag;
    }



    /*============================================================================*/
    /**
    * @brief Handle DHCP 1-second timer
    */
    /*============================================================================*/
    void w5500_dhcp_time_handler(void)
    {
        /* Call DHCP library's time handler */
        if (ETH_CONFIG_USE_DHCP) {
            DHCP_time_handler();
        }
    }




    /*============================================================================*/
    /**
    * @brief Get current IP address
    * @param ip Pointer to buffer to store IP address (4 bytes)
    */
    /*============================================================================*/
    void w5500_get_ip(uint8_t *ip)
    {
        if (ip != NULL) {
            getSIPR(ip);
        }
    }




    /*============================================================================*/
    /**
    * @brief Get current subnet mask
    * @param subnet Pointer to buffer to store subnet mask (4 bytes)
    */
    /*============================================================================*/
    void w5500_get_subnet(uint8_t *subnet)
    {
        if (subnet != NULL) {
            getSUBR(subnet);
        }
    }



    /*============================================================================*/
    /**
    * @brief Get current gateway address
    * @param gateway Pointer to buffer to store gateway address (4 bytes)
    */
    /*============================================================================*/
    void w5500_get_gateway(uint8_t *gateway)
    {
        if (gateway != NULL) {
            getGAR(gateway);
        }
    }



    /*============================================================================*/
    /**
    * @brief Get current DNS server address
    * @param dns Pointer to buffer to store DNS server address (4 bytes)
    */
    /*============================================================================*/
    void w5500_get_dns(uint8_t *dns)
    {
        if (dns != NULL) {
            getDNSR(dns);
        }
    }

    /*============================================================================*/
    /**
    * @brief Initialize device discovery service
    * @return true if initialization succeeded, false otherwise
    */
    /*============================================================================*/
    bool w5500_discovery_init(void)
    {
        /* Check if IP is assigned - discovery won't work without IP */
        if (!w5500_is_ip_assigned()) {
            DEBUG_PRINT("w5500_discovery_init: No IP assigned, cannot initialize discovery\r\n");
            return false;
        }
        
        /* Close the socket if it was already in use */
        w5500_close(discovery_socket);
        
        /* Open a UDP socket for discovery */
        if (w5500_socket(discovery_socket, Sn_MR_UDP, ETH_CONFIG_DISCOVERY_PORT, 0) != discovery_socket) {
            DEBUG_PRINT("w5500_discovery_init: Failed to create discovery socket\r\n");
            return false;
        }
        
        discovery_initialized = true;
        DEBUG_PRINT("w5500_discovery_init: Device discovery initialized on socket %d port %d\r\n", 
                discovery_socket, ETH_CONFIG_DISCOVERY_PORT);
        
