narudoltatiyavattanachai/stm32f103_w5500/Middlewares/In_House/drivers/eth/w5500_socket.c
        /* Send initial announcement */
        w5500_send_announcement();
        
        return true;
    }




    /*============================================================================*/
    /**
    * @brief Process device discovery tasks, handle incoming discovery requests
    * @return true if any activity occurred, false otherwise
    */
    /*============================================================================*/
    bool w5500_discovery_process(void)
    {
        if (!discovery_initialized || !ip_assigned_flag) {
            return false;
        }
        
        uint8_t remote_ip[4];
        uint16_t remote_port;
        int32_t len;
        bool activity = false;
        
        /* Check for incoming discovery requests */
        if ((len = w5500_recvfrom(discovery_socket, discovery_buffer, sizeof(discovery_buffer), 
                                remote_ip, &remote_port)) > 0) {
            activity = true;
            
            /* Parse discovery request */
            if (strncmp((char*)discovery_buffer, "DISCOVER_STM32", 14) == 0) {
                DEBUG_PRINT("w5500_discovery_process: Received discovery request from %d.%d.%d.%d:%d\r\n",
                        remote_ip[0], remote_ip[1], remote_ip[2], remote_ip[3], remote_port);
                
                /* Prepare response with device information */
                uint8_t local_ip[4];
                w5500_get_ip(local_ip);
                
                /* Format device info as JSON */
                len = snprintf((char*)discovery_resp_buffer, sizeof(discovery_resp_buffer),
                            "{\"hostname\":\"%s\",\"ip\":\"%d.%d.%d.%d\",\"type\":\"%s\",\"version\":\"%s\"}",
                            ETH_CONFIG_HOSTNAME, 
                            local_ip[0], local_ip[1], local_ip[2], local_ip[3],
                            ETH_CONFIG_DEVICE_TYPE, 
                            ETH_CONFIG_FW_VERSION);
                
                /* Send response */
                w5500_sendto(discovery_socket, discovery_resp_buffer, len, remote_ip, remote_port);
                
                /* Call discovery callback if registered */
                if (discovery_callback != NULL) {
                    discovery_callback(remote_ip, remote_port);
                }
            }
        }
        
        return activity;
    }



    /*============================================================================*/
    /**
    * @brief Send device announcement broadcast
    * @return true if announcement was sent successfully, false otherwise
    */
    /*============================================================================*/
    bool w5500_send_announcement(void)
    {
        if (!discovery_initialized || !ip_assigned_flag) {
            return false;
        }
        
        /* Prepare broadcast address */
        uint8_t subnet[4];
        uint8_t local_ip[4];
        uint8_t broadcast_ip[4];
        w5500_get_subnet(subnet);
        w5500_get_ip(local_ip);
        
        /* Calculate broadcast address (IP | ~Subnet) */
        for (int i = 0; i < 4; i++) {
            broadcast_ip[i] = local_ip[i] | (~subnet[i] & 0xFF);
        }
        
        /* Format announcement message as JSON */
        int32_t len = snprintf((char*)discovery_resp_buffer, sizeof(discovery_resp_buffer),
                            "{\"announce\":\"stm32_device\",\"hostname\":\"%s\",\"ip\":\"%d.%d.%d.%d\",\"type\":\"%s\"}",
                            ETH_CONFIG_HOSTNAME, 
                            local_ip[0], local_ip[1], local_ip[2], local_ip[3],
                            ETH_CONFIG_DEVICE_TYPE);
        
        /* Send broadcast */
        if (w5500_sendto(discovery_socket, discovery_resp_buffer, len, broadcast_ip, ETH_CONFIG_DISCOVERY_PORT) <= 0) {
            DEBUG_PRINT("w5500_send_announcement: Failed to send announcement\r\n");
            return false;
        }
        
        DEBUG_PRINT("w5500_send_announcement: Broadcast announcement to %d.%d.%d.%d:%d\r\n",
                broadcast_ip[0], broadcast_ip[1], broadcast_ip[2], broadcast_ip[3], ETH_CONFIG_DISCOVERY_PORT);
        
        return true;
    }

    /*============================================================================*/
    /**
    * @brief Set callback for when the device is discovered
    * @param callback Callback function to call when device is discovered
    */
    /*============================================================================*/
    void w5500_set_discovery_callback(void (*callback)(uint8_t *remote_ip, uint16_t remote_port))
    {
        discovery_callback = callback;
    }

    /*============================================================================*/
    /**
    * @brief Create a UDP socket (UDP-only implementation)
    * @param socket_num Socket number
    * @param protocol Must be Sn_MR_UDP (UDP only)
    * @param port Port number
    * @param flag Socket flag (0 for normal operation)
    * @return Socket number on success, negative value on error
    * @note Only UDP sockets are supported due to resource constraints.
    */
    /*============================================================================*/
    int8_t w5500_socket(uint8_t socket_num, uint8_t protocol, uint16_t port, uint8_t flag)
    {
        if (protocol != Sn_MR_UDP) {
            DEBUG_PRINT("w5500_socket: Only UDP sockets are supported!\r\n");
            return -1;
        }
        DEBUG_PRINT("w5500_socket: Creating UDP socket %d port %d flag %d\r\n", socket_num, port, flag);
        return socket(socket_num, protocol, port, flag);
    }

    /*============================================================================*/
    /*                         SOCKET STATE AND DATA OPERATIONS                   */
    /*============================================================================*/

    /*============================================================================*/
    /**
    * @brief Close a socket
    * @param socket_num Socket number
    * @return 0 on success, negative value on error
    */
    /*============================================================================*/
    int8_t w5500_close(uint8_t socket_num)
    {
        DEBUG_PRINT("w5500_close: Closing socket %d\r\n", socket_num);
        return close(socket_num);
    }

