narudoltatiyavattanachai/stm32f103_w5500/Middlewares/In_House/drivers/eth/w5500_socket.c
    /*============================================================================*/
    /**
    * @brief Send data through a UDP socket to a specific destination
    * @param socket_num Socket number
    * @param data Pointer to data buffer
    * @param data_len Length of data to send
    * @param remote_ip Pointer to remote IP address (4 bytes)
    * @param remote_port Remote port number
    * @return Number of bytes sent on success, negative value on error
    */
    /*============================================================================*/
    int32_t w5500_sendto(uint8_t socket_num, const uint8_t *data, uint16_t data_len, 
                        const uint8_t *remote_ip, uint16_t remote_port)
    {
        if (!data || data_len == 0 || !remote_ip) {
            DEBUG_PRINT("w5500_sendto: Invalid input (null pointer or zero length)\r\n");
            return -1;
        }
        DEBUG_PRINT("w5500_sendto: Sending %d bytes on socket %d to %d.%d.%d.%d:%d\r\n", 
                    data_len, socket_num, remote_ip[0], remote_ip[1], remote_ip[2], remote_ip[3], remote_port);
        /* Cast away const qualifiers as third-party API doesn't use const, but these parameters won't be modified */
        int32_t result = sendto(socket_num, (uint8_t*)data, data_len, (uint8_t*)remote_ip, remote_port);
        if (result < 0) {
            DEBUG_PRINT("w5500_sendto: sendto() failed with code %ld\r\n", result);
        }
        return result;
    }

    /*============================================================================*/
    /**
    * @brief Receive data from a UDP socket
    * @param socket_num Socket number
    * @param data Pointer to buffer to store received data
    * @param data_len Length of buffer
    * @param remote_ip Pointer to buffer to store remote IP address (4 bytes)
    * @param remote_port Pointer to store remote port number
    * @return Number of bytes received on success, negative value on error
    */
    /*============================================================================*/
    int32_t w5500_recvfrom(uint8_t socket_num, uint8_t *data, uint16_t data_len, 
                        uint8_t *remote_ip, uint16_t *remote_port)
    {
        int32_t ret = recvfrom(socket_num, data, data_len, remote_ip, remote_port);
        if (ret > 0) {
            DEBUG_PRINT("w5500_recvfrom: Received %d bytes on socket %d from %d.%d.%d.%d:%d\r\n", 
                    ret, socket_num, remote_ip[0], remote_ip[1], remote_ip[2], remote_ip[3], *remote_port);
        }
        return ret;
    }

    /*============================================================================*/
    /**
    * @brief Set socket option
    * @param socket_num Socket number
    * @param option_type Option type
    * @param option_value Pointer to option value
    * @return 0 on success, negative value on error
    */
    /*============================================================================*/
    int8_t w5500_setsockopt(uint8_t socket_num, uint8_t option_type, void *option_value)
    {
        DEBUG_PRINT("w5500_setsockopt: Setting option %d on socket %d\r\n", option_type, socket_num);
        return setsockopt(socket_num, option_type, option_value);
    }

    /*============================================================================*/
    /**
    * @brief Get socket option
    * @param socket_num Socket number
    * @param option_type Option type
    * @param option_value Pointer to option value
    * @return 0 on success, negative value on error
    */
    /*============================================================================*/
    int8_t w5500_getsockopt(uint8_t socket_num, uint8_t option_type, void *option_value)
    {
        int8_t ret = getsockopt(socket_num, option_type, option_value);
        DEBUG_PRINT("w5500_getsockopt: Getting option %d from socket %d, result %d\r\n", 
                    option_type, socket_num, ret);
        return ret;
    }

    /*============================================================================*/
    /**
    * @brief Get socket status
    * @param socket_num Socket number
    * @return Socket status register value
    */
    /*============================================================================*/
    uint8_t w5500_socket_status(uint8_t socket_num)
    {
        uint8_t status = getSn_SR(socket_num);
        DEBUG_PRINT("w5500_socket_status: Socket %d status = 0x%02X\r\n", socket_num, status);
        return status;
    }
